Revit 2027 API
ParameterTypeId.IfcGuid Property
 "IfcGUID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcGuid { get; }
Public Shared ReadOnly Property IfcGuid As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcGuid {
	ForgeTypeId^ get ();
}
static member IfcGuid : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace